In [17]:
import pandas as pd
data={
    "height":[120,85],
    "weight":[65,14],
    "age":[15,None]
}
df=pd.DataFrame(data)
df

   height  weight   age
0     120      65  15.0
1      85      14   NaN

In [28]:
df=df.dropna()
df

   height  weight   age
0     120      65  15.0

In [36]:
import pandas as pd
data1 ={
    "weight":[34,46,None],
    "name":["anu","manu","adith"],
     "age":[25,30,23]
}
df1 = pd.DataFrame(data1)
df1

   weight   name  age
0    34.0    anu   25
1    46.0   manu   30
2     NaN  adith   23

In [38]:
df1=df1.fillna({'weight':42})
df1

   weight   name  age
0    34.0    anu   25
1    46.0   manu   30
2    42.0  adith   23